---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData
source: html/cac49798-7306-051f-796b-9250a0406a21.htm
---
# MEPAnalyticalModelData Methods

Gets the MEP analytical model data of the specified element.